app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes"
---
  def index
    respond_to do |format|
      format.html
      format.json{render json: Note.all}